<?php require("modules/header.php"); ?>

<div id="contents" class="clearfix">

<div id="main">

<h2>研究事例：深井 晴香</h2>

<h3>研究概要</h3>
<div class="sectionBorder clearfix">
<h4>インタラクティブなクロス・メディア検索による音楽と動画像のマッシュアップ・エンジン</h4>
本研究の目的は、音楽や動画データなどの特定の時系列メディアデータを対象として、その内容に応じて、全く異なる別のメディアデータ(色、画像)を装飾的に表示する新たなメディア表現機構を構築することである。現在、Web上において一般ユーザが作成したマルチメディアデータ（Customer Generated Media）が増大しており、それらメディアデータを統合的に利用するメディア・マッシュアップが、重要なアプリケーションとして認識されている。そこで、本研究は、音楽メディアと画像メディアを対象とした異種メディア間の相関量計算により、関連性の強い異種メディアデータを動的に連結し、レンダリングする、クロス・メディア・マッシュアップ・エンジンを提案する。このクロス・メディア・マッシュアップ・エンジンの特徴は、時系列メディアデータと、他の異なる装飾的メディアデータとの関連性を、利用者個人の感性的嗜好に応じて計量するために、既存のメディアデータを用いて、異種メディアデータ間の特徴量の関係を記述した特徴量変換行列を、利用者毎に個人化するリアルタイム・フィードバック型学習機能を有する点にある。本研究の利点は、実際に装飾された結果を見ながら、特徴量変換行列の評価と学習を行うことができるため、インタラクティブかつ直感的にクロス・メディア・マッシュアップのための感性個人化プロセスを実行できることである。 
</div>

<!-- / #main --></div>

<?php require("modules/sub.php"); ?>

<!-- / #contents --></div>

<?php require("modules/footer.php"); ?>