<?php require("modules/header.php"); ?>

<div id="contents" class="clearfix">

<div id="main">

<h2>研究会シラバス</h2>
<div class="section">
<h4>ダイナミックメディアのための検索・可視化・配信システムの研究</h4>
<div class="imgR"><img src="img/img-216-139.png" alt="画像" width="216" height="139" /></div>
現在のWebの主役は、動画像、音楽、ソーシャルネットワークに代表される、動きのあるメディア、すなわち、ダイナミックメディアです。 <br />
<br />
本研究会では、「リアルタイム性」「デザイン」「感性」という全く新しい視点から、動画像（YouTubeやテレビ）、音楽データ、ソーシャルネットワークから獲得されるライブ動画像を対象とし、それらを多様なコンテキストを持つ時系列メディアデータとして捉え、検索、可視化、自動配信を行う“感性メディア・ハブ機構”の構築に取り組んでいます。感性メディア・ハブ機構は、我が国が「コンテンツ立国」を目指す上で、多種多様なマルチメディア情報を共有・検索・統合するネットワーク上の拠点となるものであり、国内外に向けたコンテンツ流通を支える最も主要な要素として位置付けることが出来るものです。 
</div>

<h3>今年度の3テーマ</h3>
<div class="sectionBorder clearfix">
<h4>今年度は、特に次の3テーマに集中的に取り組みます。</h4>
<div class="box">
<div class="MG-B5"><img src="img/img-190-70_1.png" alt="画像" width="190" height="70" /></div>
<h4>可視化</h4>
<div class="TXT-S">メディアデータにおける時空間的な変動、ストーリー性を直感的に表示する手法の研究</div>
</div>
<div class="box">
<div class="MG-B5"><img src="img/img-190-70_2.png" alt="画像" width="190" height="70" /></div>
<h4>個人化</h4>
<div class="TXT-S">利用者個人のコンテクストに応じた情報の選択的配信手法の研究</div>
</div>
<div class="box-end">
<div class="MG-B5"><img src="img/img-190-70_3.png" alt="画像" width="190" height="70" /></div>
<h4>集合知</h4>
<div class="TXT-S">　利用者が蓄積する履歴情報にデータマイニングを適用し、有意な知識を獲得する手法の研究</div>
</div>
</div>

<h3>内容</h3>
<div class="sectionBorder clearfix">
例えば、感性メディア・ハブ機構は、YouTube上にアップロードされた動画像の内容（色彩等）を自動的に分析し、利用者の好みに応じて配信するといった、“マルチメディアデータの自動分析・配信”を実現します。また、自分のブログの内容（テキスト）に合わせて自動的に関連動画やサイトがリンクされたり、“つぶやき”の内容に応じて広告を表示したりといった、“自動的なWebサイト構築”を実現することができます。ユビキタス環境では、Webカメラの前に立った利用者の動作に応じてマルチメディアデータを提示するといった、インタラクティブな応用も考えられます。<br />
<br />
本研究会では、感性メディア・ハブ機構に関するコア・システムの設計・構築だけでなく、新しいマルチメディアデータの分析手法の設計・構築、新しいWebサービスの設計・構築、実問題解決のためのアプリケーションの設計・構築に取り組んでいきます。また、企業との共同研究にも取り組んでいます。例えば、現在、下記のような研究テーマに取り組んでいます。<br />
<br />
<a href="research.html">研究会メンバによる研究内容</a><br />
<br />
<ul>
<li>利用者の感性的嗜好に応じた動画像ストーリー検索エンジン </li>
<li>Googleの検索結果を対象とした自動分析・自動SEO・自動キーワード推薦システム </li>
<li>iPhone, Android携帯を対象とした位置情報ベースのメディア配信システム</li> 
<li>書籍のレイアウト情報、色彩情報を組み合わせた、書籍検索システム </li>
<li>音楽内容を対象としたインタラクティブ３D可視化・個人化機構を有する音楽データベースシステム </li>
<li>インタラクティブなクロス・メディア検索による音楽と動画像のマッシュアップ・エンジン </li>
<li>Twitterにおける重要発言・重要人物自動抽出システム </li>
<li>モバイル端末を用いたインタラクティブな風景合成エンジン </li>
</ul>
これらの他に自分で問題を考え、それを解決していくことも大歓迎です。 <br />
本研究会では、一人一人がオリジナルの研究テーマを設定し、実際にシステムを設計・構築・評価していきます。そして、その研究成果を論文としてまとめ国内外の学会に発表することを目標とします。世界に向けて自分のアイディアを発信していく情熱を持った学生を歓迎します。また、本研究会では、実際にシステムを設計・実装・評価することを必須とします。最初からプログラミングができる必要はありませんが、研究会の中でプログラミング能力を伸ばしていく意欲を持ちましょう。<br />
<br />
選考方法や、成績評価に関しては、以下のシラバスを確認してください。<br />
<a href="http://vu8.sfc.keio.ac.jp/course2007/seminar/p_syll_view.cgi?yc=2011_33355">00101 研究会A（倉林 修一） 「ダイナミックメディアのための検索・可視化・配信システムの研究」</a>
</div>

<!-- / #main --></div>

<?php require("modules/sub.php"); ?>

<!-- / #contents --></div>

<?php require("modules/footer.php"); ?>